import pandas as pd
import numpy as np
df = pd.DataFrame({
    'Unnamed: 0': [0,1,2,3,4,5,6,'new',10],
    '메뉴': ['황금후라이드','승일양념치킨','간장치킨','마늘치킨','파닭','닭강정','양념반후라이드반','[인기]아이펠치킨','[베스트]풀잎치킨'],
    '가격': [12000,13000,14000,14000,14000,15000,13000,16000,9900],
    '호수' : ['10호','10호','9호','9호','11호','12호','10호','11호','10호'],
    '칼로리' : [1000.0,1400.0,1600.0,1800.0,1300.0,1500.0,1300.0,1200.0,np.nan],
    '할인율' : [0.2,0.2,0.2,0.2,0.2,0.2,0.2,0.5,np.nan],
    '할인가' : [9600.0,10400.0,11200.0,11200.0,11200.0,12000.0,10400.0,8000.0,np.nan],
    '원산지' : ['국내산',np.nan,np.nan,np.nan,'브라질','브라질',np.nan,'국내산',np.nan]
})

# 카운트 (컬럼) #기본값 axis=0
df.count()

# 카운트 (행)
df.count(axis=1)

# [Tip] 데이터 수 len, shape
# len(df)
df.shape[0]

# 최대값
df['가격'].max()

# 최소값
df['가격'].min()

# 평균
df['가격'].mean()

# 중앙값
df['가격'].median()

# 합계
df['가격'].sum()

# 표준편차
df['가격'].std()

# 분산
df['가격'].var()

# 백분위수
df['가격'].describe()

# 하위 25% 값
df['가격'].quantile(.25)

# 상위 25% 값
df['가격'].quantile(.75)

# 하위 25% 작은 데이터
cond = df['가격'].quantile(.25) > df['가격']

# 상위 25% 큰 데이터
cond = df['가격'].quantile(.75) < df['가격']

# 최빈값 구하기
df['원산지'].mode()[0]

# 행과 열 바꾸기 (transpose)
df.T